---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralFrameCutLength
source: html/fa579509-bc8b-9ff1-23b2-233541b43375.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralFrameCutLength Property

"Cut Length"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralFrameCutLength { get; }
```